In [3]:
import numpy as np
import pandas as pd
import seaborn as sns
#np.random.randn?

In [11]:
label = ['a', 'b','c','d'] #List
my_list = [10,20,30,40] #Tuple
dict = {'a':10, 'b':20, 'c':40} #Dictionary

In [13]:
series1 = pd.Series(dict);

In [14]:
series1

a    10
b    20
c    40
dtype: int64

In [17]:
series2 = pd.Series(my_list)
series2

0    10
1    20
2    30
3    40
dtype: int64

In [19]:
series1 + series2

a   NaN
b   NaN
c   NaN
0   NaN
1   NaN
2   NaN
3   NaN
dtype: float64

In [24]:
dict2 = {'a':100, 'b':200, 'c':400}

In [25]:
series1 + pd.Series(dict2)

a    110
b    220
c    440
dtype: int64

In [27]:
data = np.random.randn(5,4)

In [76]:
df = pd.DataFrame(data, index=['A','B','C','D','E'], columns=['w','x','y','z'])
df.iloc[:3,0] = 'male'
df.iloc[3:,0] = 'female'
#df[('w','C')] = 'female'
df

        w         x         y         z
A    male  0.297444  0.181714 -0.321075
B    male  0.185179  1.412089  0.102332
C    male  0.656010 -0.006697  0.519768
D  female  1.329680 -0.020621 -0.123918
E  female  0.291201 -0.613058  0.654697

In [80]:
df[df['w'].apply(lambda x: x == 'male')]

      w         x         y         z
A  male  0.297444  0.181714 -0.321075
B  male  0.185179  1.412089  0.102332
C  male  0.656010 -0.006697  0.519768

In [30]:
df.columns

Index(['w', 'x', 'y', 'z'], dtype='object')

In [39]:
df.nunique()

w    2
x    5
y    5
z    5
dtype: int64

In [40]:
df['w'].value_counts()

male      3
female    2
Name: w, dtype: int64

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
w    5 non-null object
x    5 non-null float64
y    5 non-null float64
z    5 non-null float64
dtypes: float64(3), object(1)
memory usage: 200.0+ bytes

In [42]:
df.describe()

              x         y         z
count  5.000000  5.000000  5.000000
mean   0.551903  0.190685  0.166361
std    0.469834  0.745238  0.415128
min    0.185179 -0.613058 -0.321075
25%    0.291201 -0.020621 -0.123918
50%    0.297444 -0.006697  0.102332
75%    0.656010  0.181714  0.519768
max    1.329680  1.412089  0.654697

In [44]:
type(df['y'])

pandas.core.series.Series

In [45]:
df[['x','y']]

          x         y
A  0.297444  0.181714
B  0.185179  1.412089
C  0.656010 -0.006697
D  1.329680 -0.020621
E  0.291201 -0.613058

In [46]:
df['sum'] = df.x + df.y

In [47]:
df

        w         x         y         z       sum
A    male  0.297444  0.181714 -0.321075  0.479158
B    male  0.185179  1.412089  0.102332  1.597268
C    male  0.656010 -0.006697  0.519768  0.649313
D  female  1.329680 -0.020621 -0.123918  1.309058
E  female  0.291201 -0.613058  0.654697 -0.321857

In [57]:
df.drop('z', axis=1, inplace=True)
df

        w         x         y
A    male  0.297444  0.181714
B    male  0.185179  1.412089
C    male  0.656010 -0.006697
D  female  1.329680 -0.020621
E  female  0.291201 -0.613058

In [58]:
df.shape

(5, 3)

In [59]:
df = pd.DataFrame({'A':[1,2,np.nan], 'B':[5, np.nan, np.nan], 'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [69]:
df.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [71]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [72]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3